{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 102,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 100,
      "special": false,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 101,
      "special": false,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "(": 1,
      ")": 2,
      "+": 3,
      "-": 4,
      ".": 5,
      "/": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "=": 12,
      "C": 13,
      "H": 14,
      "N": 15,
      "O": 16,
      "S": 17,
      "[": 18,
      "\\": 19,
      "]": 20,
      "c": 21,
      "n": 22,
      "o": 23,
      "Ċ": 24,
      "CC": 25,
      "cc": 26,
      "OC": 27,
      "CCC": 28,
      "(=": 29,
      "CN": 30,
      "CO": 31,
      "NC": 32,
      "COC": 33,
      "12": 34,
      "ccc": 35,
      "ccccc": 36,
      "OCC": 37,
      ")=": 38,
      "NN": 39,
      ")(": 40,
      "CCO": 41,
      "CNC": 42,
      "CCCC": 43,
      "Cc": 44,
      "CCN": 45,
      "CCOC": 46,
      "COCC": 47,
      "NO": 48,
      "NCC": 49,
      "21": 50,
      "nc": 51,
      "nH": 52,
      "NNC": 53,
      "NOC": 54,
      "CCNC": 55,
      "CNCC": 56,
      "oc": 57,
      "CCCCC": 58,
      "CCCO": 59,
      "Nc": 60,
      "OCCC": 61,
      "CCc": 62,
      "cn": 63,
      "CCOCC": 64,
      "COc": 65,
      "CNN": 66,
      "ON": 67,
      "CCCN": 68,
      "nn": 69,
      "NOCC": 70,
      "CON": 71,
      "CCCOC": 72,
      "Oc": 73,
      "ncc": 74,
      "NCCC": 75,
      "cccc": 76,
      "23": 77,
      "COCCC": 78,
      "Cn": 79,
      "co": 80,
      "NNCC": 81,
      "cnc": 82,
      ")[": 83,
      "OCOC": 84,
      "13": 85,
      "CCNCC": 86,
      "32": 87,
      "OCCO": 88,
      "coc": 89,
      "COCOC": 90,
      "ccoc": 91,
      "CNc": 92,
      "no": 93,
      "COCO": 94,
      "CCON": 95,
      "CCOc": 96,
      "OCO": 97,
      "NCc": 98,
      "ccn": 99
    },
    "merges": [
      "C C",
      "c c",
      "O C",
      "CC C",
      "( =",
      "C N",
      "C O",
      "N C",
      "C OC",
      "1 2",
      "cc c",
      "cc ccc",
      "O CC",
      ") =",
      "N N",
      ") (",
      "CC O",
      "CN C",
      "CC CC",
      "C c",
      "CC N",
      "CC OC",
      "CO CC",
      "N O",
      "N CC",
      "2 1",
      "n c",
      "n H",
      "N NC",
      "N OC",
      "CC NC",
      "CN CC",
      "o c",
      "CC CCC",
      "CCC O",
      "N c",
      "O CCC",
      "CC c",
      "c n",
      "CC OCC",
      "CO c",
      "CN N",
      "O N",
      "CCC N",
      "n n",
      "N OCC",
      "CO N",
      "CCC OC",
      "O c",
      "n cc",
      "N CCC",
      "cc cc",
      "2 3",
      "CO CCC",
      "C n",
      "c o",
      "NN CC",
      "c nc",
      ") [",
      "OC OC",
      "1 3",
      "CCN CC",
      "3 2",
      "OCC O",
      "c oc",
      "COC OC",
      "cc oc",
      "CN c",
      "n o",
      "COC O",
      "CCO N",
      "CCO c",
      "OC O",
      "NC c",
      "cc n"
    ]
  }
}