{
  "version": "1.0",
  "truncation": {
    "max_length": 150,
    "strategy": "OnlyFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 150
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 2002,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 439,
      "special": false,
      "content": "<start>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 440,
      "special": false,
      "content": "<end>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "#": 0,
      "(": 1,
      ")": 2,
      "+": 3,
      "-": 4,
      ".": 5,
      "/": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "=": 12,
      "C": 13,
      "H": 14,
      "N": 15,
      "O": 16,
      "S": 17,
      "[": 18,
      "\\": 19,
      "]": 20,
      "c": 21,
      "n": 22,
      "o": 23,
      "Ċ": 24,
      "CC": 25,
      "cc": 26,
      "OC": 27,
      "CCC": 28,
      "(=": 29,
      "CN": 30,
      "CO": 31,
      "NC": 32,
      "COC": 33,
      "12": 34,
      "ccc": 35,
      "ccccc": 36,
      "OCC": 37,
      ")=": 38,
      "NN": 39,
      ")(": 40,
      "CCO": 41,
      "CNC": 42,
      "CCCC": 43,
      "Cc": 44,
      "CCN": 45,
      "CCOC": 46,
      "COCC": 47,
      "NO": 48,
      "NCC": 49,
      "21": 50,
      "nc": 51,
      "nH": 52,
      "NNC": 53,
      "NOC": 54,
      "CCNC": 55,
      "CNCC": 56,
      "oc": 57,
      "CCCCC": 58,
      "CCCO": 59,
      "Nc": 60,
      "OCCC": 61,
      "CCc": 62,
      "cn": 63,
      "CCOCC": 64,
      "COc": 65,
      "CNN": 66,
      "ON": 67,
      "CCCN": 68,
      "nn": 69,
      "NOCC": 70,
      "CON": 71,
      "CCCOC": 72,
      "Oc": 73,
      "ncc": 74,
      "NCCC": 75,
      "cccc": 76,
      "23": 77,
      "COCCC": 78,
      "Cn": 79,
      "co": 80,
      "NNCC": 81,
      "cnc": 82,
      ")[": 83,
      "OCOC": 84,
      "13": 85,
      "CCNCC": 86,
      "32": 87,
      "OCCO": 88,
      "coc": 89,
      "COCOC": 90,
      "ccoc": 91,
      "CNc": 92,
      "no": 93,
      "COCO": 94,
      "CCON": 95,
      "CCOc": 96,
      "OCO": 97,
      "NCc": 98,
      "ccn": 99,
      "CCCc": 100,
      "NCCN": 101,
      "CCCNC": 102,
      "on": 103,
      "CCNN": 104,
      "CNCCC": 105,
      "OCc": 106,
      "CCCCO": 107,
      "occc": 108,
      "cocc": 109,
      "ccco": 110,
      "OCCCC": 111,
      "ncn": 112,
      "CCn": 113,
      "CNNC": 114,
      "NCCO": 115,
      "cccn": 116,
      "occ": 117,
      "OCCN": 118,
      "CCCCCC": 119,
      "COCCO": 120,
      "CCCCN": 121,
      "CCCOCC": 122,
      "31": 123,
      "ccnc": 124,
      "nnc": 125,
      ")/": 126,
      "Nn": 127,
      "CCCCOC": 128,
      "CONC": 129,
      "cnoc": 130,
      "COCc": 131,
      "CNO": 132,
      "NOCCC": 133,
      "ONC": 134,
      "CCOCCC": 135,
      "cnn": 136,
      "cncn": 137,
      "NCCCC": 138,
      "NNc": 139,
      "CNCc": 140,
      "CCNc": 141,
      "OCCOC": 142,
      "CCOCOC": 143,
      "cncc": 144,
      "COCCN": 145,
      "NNCCC": 146,
      "NCCc": 147,
      "noc": 148,
      "CNCCN": 149,
      "conc": 150,
      "nccn": 151,
      "COn": 152,
      "nonc": 153,
      "ccnn": 154,
      "NCCOC": 155,
      "ocnc": 156,
      "cnnc": 157,
      "nocc": 158,
      "(\\": 159,
      "nccc": 160,
      "COCCCC": 161,
      "OCCc": 162,
      "CCOCO": 163,
      "COCOCC": 164,
      "cccnc": 165,
      "CCCCNC": 166,
      "ncoc": 167,
      "ccccn": 168,
      "(/": 169,
      "COCCOC": 170,
      "CCNNC": 171,
      "([": 172,
      "ccncc": 173,
      "OCCCO": 174,
      "CNCCO": 175,
      "CCCCCO": 176,
      "CCCOc": 177,
      "CCCCc": 178,
      "COCCNC": 179,
      "CCCON": 180,
      "On": 181,
      "oncc": 182,
      "OCOCC": 183,
      "42": 184,
      "onc": 185,
      "CCONC": 186,
      "][": 187,
      "ccon": 188,
      "ncco": 189,
      "onnc": 190,
      "NCCCN": 191,
      "CCCNN": 192,
      "CCOCCO": 193,
      "+]": 194,
      "-]": 195,
      "CCCNCC": 196,
      "CNn": 197,
      "CNOC": 198,
      "ncnc": 199,
      "ncnn": 200,
      "ncno": 201,
      "CCNCCC": 202,
      "nnoc": 203,
      "CCOCc": 204,
      "nnnn": 205,
      "ncccc": 206,
      "(#": 207,
      "ccno": 208,
      "CCCCOCC": 209,
      "cocn": 210,
      "(-": 211,
      "NCCCO": 212,
      "NOCO": 213,
      "cncnc": 214,
      "14": 215,
      "34": 216,
      "COCCCO": 217,
      "CCCCCCC": 218,
      "ncon": 219,
      "cnco": 220,
      "-])": 221,
      "OCCNC": 222,
      "NCCNC": 223,
      "NOCc": 224,
      "CCNCc": 225,
      "CCCCCOC": 226,
      "nnn": 227,
      "NOCCN": 228,
      "+](=": 229,
      "cco": 230,
      "CCCn": 231,
      "CNOCC": 232,
      "CNCCCC": 233,
      "NNCCO": 234,
      "CCOCOCC": 235,
      "OCCCc": 236,
      "cnnn": 237,
      "nnco": 238,
      "ncccn": 239,
      "CCCNc": 240,
      "OCCCCC": 241,
      "OCCOCC": 242,
      "NNCc": 243,
      "NOCOC": 244,
      "CCCOCCC": 245,
      "OCCCN": 246,
      "cnno": 247,
      "CCOCCOC": 248,
      "nnnc": 249,
      "NCCCOC": 250,
      "nncn": 251,
      "CNCCNC": 252,
      "OCCOc": 253,
      "CCNCCO": 254,
      "CCCCCN": 255,
      "cnccc": 256,
      "CCOCCCC": 257,
      "CCCCOc": 258,
      "CNNCC": 259,
      "COCON": 260,
      "cccnn": 261,
      "CCCCNCC": 262,
      "COCCc": 263,
      "cnon": 264,
      "CCCNCCC": 265,
      "NOCCCC": 266,
      "CCCOCOC": 267,
      "conn": 268,
      "ccnnc": 269,
      "OO": 270,
      "CCCOCCO": 271,
      "CNCCOC": 272,
      "CNCCCN": 273,
      "NNCCN": 274,
      "CCNCCN": 275,
      "COCCCCC": 276,
      "COCCOCC": 277,
      "NCCCCC": 278,
      "CCCCCc": 279,
      "CCOCCN": 280,
      "nncc": 281,
      "cocnc": 282,
      "=[": 283,
      "NCCNCC": 284,
      "NCCON": 285,
      "NCCOc": 286,
      "OOC": 287,
      "ccncn": 288,
      "CCCNCc": 289,
      "OCCNc": 290,
      "CCCCCCCC": 291,
      "ncncc": 292,
      "CCOCCc": 293,
      "NOCCO": 294,
      "CCCOCO": 295,
      "CCCOCc": 296,
      "+]([": 297,
      ")\\": 298,
      "41": 299,
      "43": 300,
      "CCCCON": 301,
      "CCCNNC": 302,
      "COCOCCC": 303,
      "123": 304,
      "cccoc": 305,
      "NNCCc": 306,
      "CCCCNc": 307,
      "CCNn": 308,
      "NOCCCO": 309,
      "nco": 310,
      "ncncn": 311,
      "NOCON": 312,
      "CNCCc": 313,
      "CCCCCNC": 314,
      "CCCONC": 315,
      "OCCCNC": 316,
      "cnncc": 317,
      "CCOCCOCC": 318,
      "NOCCNC": 319,
      "nccnc": 320,
      "COCCCNC": 321,
      ")-": 322,
      "NCCCCN": 323,
      "ONc": 324,
      "occn": 325,
      "OCOCCC": 326,
      "COCCCOC": 327,
      "NNCCCC": 328,
      "CCOn": 329,
      "CCNCCCC": 330,
      "NOc": 331,
      "NCCOCC": 332,
      "CCCCCOc": 333,
      "cnccn": 334,
      "cnnnc": 335,
      "NCCCc": 336,
      "NCCCNC": 337,
      "con": 338,
      "NCCNc": 339,
      "24": 340,
      "NCO": 341,
      "ccocc": 342,
      "CCCOCCCC": 343,
      "CNCCCO": 344,
      "COCCCN": 345,
      "COCCON": 346,
      "COCCOc": 347,
      "COCOc": 348,
      "COCOCCO": 349,
      "OCCNN": 350,
      "OCCCCO": 351,
      "OCCNCC": 352,
      "NNCCCc": 353,
      "CCCCCCO": 354,
      "CCCCCCc": 355,
      "CCNCCc": 356,
      "CCNCCNCC": 357,
      "COCCCCCO": 358,
      "COCCNCc": 359,
      "NOCCCc": 360,
      "NCCNN": 361,
      "NCCCCO": 362,
      "NOCOCC": 363,
      "ocnn": 364,
      "CCOCCNC": 365,
      "nnccc": 366,
      "NOCCc": 367,
      "nccnn": 368,
      "COCCCOCC": 369,
      "coccc": 370,
      "cncnn": 371,
      "OCOCc": 372,
      "COCCONC": 373,
      "25": 374,
      "oncn": 375,
      "OCN": 376,
      "OCON": 377,
      "CCCNCCc": 378,
      "CNNc": 379,
      "CNOCCC": 380,
      "CNCCCc": 381,
      "COCCNCC": 382,
      "COCCCCCC": 383,
      "COCCCOc": 384,
      "COCOCCOC": 385,
      "cccno": 386,
      "cccncn": 387,
      "cccccn": 388,
      "OCCn": 389,
      "OCCCCc": 390,
      "OCCNCc": 391,
      "NNCCOC": 392,
      "NNCCCO": 393,
      "NNCCON": 394,
      "CCOCCCO": 395,
      "CCCCCCN": 396,
      "CCCCCCOC": 397,
      "CCCCCCCCC": 398,
      "CCCCNCc": 399,
      "CCCCCCCc": 400,
      "CCCCOCc": 401,
      "CCNCCOC": 402,
      "CCNCCOCC": 403,
      "CCOCON": 404,
      "CCOCOCCO": 405,
      "COCCn": 406,
      "COCCNN": 407,
      "COCCCCO": 408,
      "COCCOCCOC": 409,
      "NCCn": 410,
      "NCCNCc": 411,
      "NCCCCCc": 412,
      "ncocc": 413,
      "CNCCCCC": 414,
      "CNCCNN": 415,
      "CCCCCOCC": 416,
      "OCCCOC": 417,
      "CCOCCCCC": 418,
      "CCOCCCCO": 419,
      "CCCNCCCC": 420,
      "CCCNCCN": 421,
      "nno": 422,
      "nnncc": 423,
      "nnno": 424,
      "CCCOCON": 425,
      "nccncc": 426,
      "NCCCNCC": 427,
      "cccccc": 428,
      "ccccnc": 429,
      "COCCCc": 430,
      "concc": 431,
      "noccc": 432,
      "ccnoc": 433,
      "CCNNc": 434,
      "occo": 435,
      "NCCCCNC": 436,
      "NCCCCCCN": 437,
      "ccnnn": 438
    },
    "merges": [
      "C C",
      "c c",
      "O C",
      "CC C",
      "( =",
      "C N",
      "C O",
      "N C",
      "C OC",
      "1 2",
      "cc c",
      "cc ccc",
      "O CC",
      ") =",
      "N N",
      ") (",
      "CC O",
      "CN C",
      "CC CC",
      "C c",
      "CC N",
      "CC OC",
      "CO CC",
      "N O",
      "N CC",
      "2 1",
      "n c",
      "n H",
      "N NC",
      "N OC",
      "CC NC",
      "CN CC",
      "o c",
      "CC CCC",
      "CCC O",
      "N c",
      "O CCC",
      "CC c",
      "c n",
      "CC OCC",
      "CO c",
      "CN N",
      "O N",
      "CCC N",
      "n n",
      "N OCC",
      "CO N",
      "CCC OC",
      "O c",
      "n cc",
      "N CCC",
      "cc cc",
      "2 3",
      "CO CCC",
      "C n",
      "c o",
      "NN CC",
      "c nc",
      ") [",
      "OC OC",
      "1 3",
      "CCN CC",
      "3 2",
      "OCC O",
      "c oc",
      "COC OC",
      "cc oc",
      "CN c",
      "n o",
      "COC O",
      "CCO N",
      "CCO c",
      "OC O",
      "NC c",
      "cc n",
      "CCC c",
      "N CCN",
      "CCC NC",
      "o n",
      "CC NN",
      "CN CCC",
      "OC c",
      "CC CCO",
      "o ccc",
      "co cc",
      "ccc o",
      "OCC CC",
      "nc n",
      "CC n",
      "CN NC",
      "N CCO",
      "ccc n",
      "o cc",
      "OCC N",
      "CCCC CC",
      "CO CCO",
      "CCCC N",
      "CCC OCC",
      "3 1",
      "cc nc",
      "n nc",
      ") /",
      "N n",
      "CCCC OC",
      "CO NC",
      "cn oc",
      "COC c",
      "CN O",
      "NO CCC",
      "O NC",
      "CCO CCC",
      "cn n",
      "cnc n",
      "N CCCC",
      "NN c",
      "CNC c",
      "CCN c",
      "OCC OC",
      "CCOC OC",
      "cn cc",
      "CO CCN",
      "NN CCC",
      "NCC c",
      "n oc",
      "CN CCN",
      "co nc",
      "ncc n",
      "CO n",
      "no nc",
      "cc nn",
      "N CCOC",
      "oc nc",
      "cn nc",
      "no cc",
      "( \\",
      "n ccc",
      "CO CCCC",
      "OCC c",
      "CCOC O",
      "COC OCC",
      "ccc nc",
      "CCCC NC",
      "nc oc",
      "cccc n",
      "( /",
      "CO CCOC",
      "CCN NC",
      "( [",
      "cc ncc",
      "O CCCO",
      "CN CCO",
      "CCCCC O",
      "CCCO c",
      "CCCC c",
      "COCC NC",
      "CCCO N",
      "O n",
      "o ncc",
      "OC OCC",
      "4 2",
      "o nc",
      "CCO NC",
      "] [",
      "cc on",
      "ncc o",
      "on nc",
      "N CCCN",
      "CCC NN",
      "CCOCC O",
      "+ ]",
      "- ]",
      "CCC NCC",
      "CN n",
      "CN OC",
      "nc nc",
      "nc nn",
      "nc no",
      "CCN CCC",
      "nn oc",
      "CCOC c",
      "nn nn",
      "ncc cc",
      "( #",
      "cc no",
      "CCCC OCC",
      "coc n",
      "( -",
      "N CCCO",
      "NOC O",
      "cnc nc",
      "1 4",
      "3 4",
      "CO CCCO",
      "CCCC CCC",
      "nc on",
      "cnc o",
      "-] )",
      "OCC NC",
      "NCC NC",
      "NOC c",
      "CCNC c",
      "CCCCC OC",
      "nn n",
      "NOCC N",
      "+] (=",
      "cc o",
      "CCC n",
      "CN OCC",
      "CN CCCC",
      "NN CCO",
      "CCOC OCC",
      "OCCC c",
      "cn nn",
      "nnc o",
      "n cccn",
      "CCC Nc",
      "OCC CCC",
      "OCC OCC",
      "NNC c",
      "NOC OC",
      "CCCO CCC",
      "OCCC N",
      "cn no",
      "CCOCC OC",
      "nn nc",
      "N CCCOC",
      "n ncn",
      "CN CCNC",
      "OCC Oc",
      "CCN CCO",
      "CCCCC N",
      "cn ccc",
      "CCOCC CC",
      "CC CCOc",
      "CN NCC",
      "COC ON",
      "ccc nn",
      "CCCC NCC",
      "COCC c",
      "cn on",
      "CCCN CCC",
      "NOCC CC",
      "CCCOC OC",
      "co nn",
      "ccn nc",
      "O O",
      "CCC OCCO",
      "CN CCOC",
      "CN CCCN",
      "NN CCN",
      "CCN CCN",
      "COCC CCC",
      "COCC OCC",
      "NCC CCC",
      "CCCCC c",
      "CCOCC N",
      "nn cc",
      "coc nc",
      "= [",
      "N CCNCC",
      "N CCON",
      "N CCOc",
      "O OC",
      "cc ncn",
      "CCC NCc",
      "OCC Nc",
      "CCCC CCCC",
      "nc ncc",
      "CCOCC c",
      "NOCC O",
      "CCCOC O",
      "CCCOC c",
      "+] ([",
      ") \\",
      "4 1",
      "4 3",
      "CC CCON",
      "CCC NNC",
      "COC OCCC",
      "12 3",
      "ccc oc",
      "NN CCc",
      "CCCC Nc",
      "CCN n",
      "NO CCCO",
      "nc o",
      "nc ncn",
      "NOC ON",
      "CNCC c",
      "CCCCC NC",
      "CCCO NC",
      "OCCC NC",
      "cn ncc",
      "CCOCC OCC",
      "NOCC NC",
      "ncc nc",
      "COCCC NC",
      ") -",
      "N CCCCN",
      "O Nc",
      "o ccn",
      "OC OCCC",
      "CO CCCOC",
      "NN CCCC",
      "CCO n",
      "CCN CCCC",
      "NO c",
      "NCC OCC",
      "CCCCC Oc",
      "cn ccn",
      "cn nnc",
      "NCCC c",
      "NCCC NC",
      "co n",
      "NCCN c",
      "2 4",
      "N CO",
      "cc occ",
      "CCC OCCCC",
      "CN CCCO",
      "CO CCCN",
      "CO CCON",
      "CO CCOc",
      "COC Oc",
      "COC OCCO",
      "OCC NN",
      "OCC CCO",
      "OCC NCC",
      "NN CCCc",
      "CCCC CCO",
      "CCCC CCc",
      "CCN CCc",
      "CCN CCNCC",
      "COCC CCCO",
      "COCC NCc",
      "NO CCCc",
      "NCC NN",
      "NCC CCO",
      "NOC OCC",
      "oc nn",
      "CCOCC NC",
      "nn ccc",
      "NOCC c",
      "ncc nn",
      "COCCC OCC",
      "co ccc",
      "cnc nn",
      "OCOC c",
      "COCCO NC",
      "2 5",
      "o ncn",
      "OC N",
      "OC ON",
      "CCC NCCc",
      "CN Nc",
      "CN OCCC",
      "CN CCCc",
      "CO CCNCC",
      "CO CCCCCC",
      "CO CCCOc",
      "COC OCCOC",
      "ccc no",
      "ccc ncn",
      "ccccc n",
      "OCC n",
      "OCC CCc",
      "OCC NCc",
      "NN CCOC",
      "NN CCCO",
      "NN CCON",
      "CCO CCCO",
      "CCCC CCN",
      "CCCC CCOC",
      "CCCC CCCCC",
      "CCCC NCc",
      "CCCC CCCc",
      "CCCC OCc",
      "CCN CCOC",
      "CCN CCOCC",
      "CCOC ON",
      "CCOC OCCO",
      "COCC n",
      "COCC NN",
      "COCC CCO",
      "COCC OCCOC",
      "NCC n",
      "NCC NCc",
      "NCC CCCc",
      "nc occ",
      "CNCC CCC",
      "CNCC NN",
      "CCCCC OCC",
      "OCCC OC",
      "CCOCC CCC",
      "CCOCC CCO",
      "CCCN CCCC",
      "CCCN CCN",
      "nn o",
      "nn ncc",
      "nn no",
      "CCCOC ON",
      "ncc ncc",
      "NCCC NCC",
      "cccc cc",
      "cccc nc",
      "COCCC c",
      "co ncc",
      "no ccc",
      "ccn oc",
      "CCNN c",
      "occ o",
      "NCCCC NC",
      "NCCCC CCN",
      "ccnn n"
    ]
  }
}